[panel]
name=		"Core Numbers"
layer=		"ui_kbd_5_5_num"
keys=		"0123456789.-/"
altlabel=	""
type=2

[panel]
name=		"Extended Numbers"
layer=		"ui_Numpad_3_3_3_3"
keys=		"7894561230.-"
type=8


[panel]
name=		"Geo"
layer=		"ui_kbd_5_5_4"
keys=		"1234567890.°'"
altlabel=	""
type=256

[panel]
name=		"Phone"
layer=		"ui_kbd_5_5_5_3"
keys=		"123¤/456+-789()*0#"
altlabel=	""
type=4

[panel]
name=		"Русский"
layer=		"ui_kbd_national"
layout=		"12_12_11_8"
keys=		"ë1234567890'йцукенгшщзхъфывапролджэячсмитьбю "
shiftkeys=	"Ë1234567890'ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ "
altkeys=	"'1234567890/!@#$%^&*()-+·©№€;:?~{}_=\«»[]<>.,"
lang=		"russian"
label=		"*+@"
shiftlabel=	"aбв"
altlabel=	"АБВ"
type=3
family=2

[panel]
name=		"QWERTY"
layer=		"ui_kbd_national"
layout=		"12_12_12_7"
keys=		"+1234567890-¤qwertyuiop¤¤asdfghjkl¤¤¤zxcvbnm "
shiftkeys=	"+1234567890-¤QWERTYUIOP¤¤ASDFGHJKL¤¤¤ZXCVBNM "
altkeys=	"1234567890/.,'+-=()<>{}[]?!*@&#_$€!'№;%:?*"
altlabel=	"QWE"
lang=		"english AUS,english GB,english US"
label=		"*+@"
type=3
family=2

[panel]
name=		"ABC"
layer=		"ui_kbd_national"
layout=		"12_12_12_6"
keys=		" 1234567890¤¤abcdefghij¤¤klmnopqrst¤¤uvwxyz"
shiftkeys=	" 1234567890¤¤ABCDEFGHIJ¤¤KLMNOPQRST¤¤UVWXYZ"
altkeys=	"1234567890/.,'+-=()<>{}[]?!*@&#_$€!'№;%:?*"
altlabel=	"ABC"
type=3
family=1

[panel]
name=		"Українська"
layer=		"ui_kbd_national"
layout=		"12_12_12_9"
keys=		"'1234567890/йцукенгшщзхїфівапролджєґячсмитьбю "
shiftkeys=	"'1234567890/ЙЦУКЕНГШЩЗХЇФІВАПРОЛДЖЄҐЯЧСМИТЬБЮ "
altkeys=	"'1234567890/!@#$%^&*()-+·©№€;:?~{}_=\«»[]<>.,"
lang=		"ukrainian"
label=		"*+@"
shiftlabel=	"aбв"
altlabel=	"АБВ"
type=3
family=2

[panel]
name=		"Lietuvių"
layer=		"ui_kbd_national"
layout=		"12_12_12_9"
keys=		"1234567890įūqwertyuiopąžasdfghjklųėęzxcvbnmčš "
shiftkeys=	"1234567890ĮŪQWERTYUIOPĄŽASDFGHJKLŲĖĘZXCVBNMČŠ "
altkeys=	"'1234567890/!@#$%^&*()-+·©№€;:?~{}_=\«»[]<>.,"
lang=		"lithuanian"
label=		"%:?"
shiftlabel=	"aA"
altlabel=	"1qw"
type=3
family=1

[panel]
name=		"עברית"
layer=		"ui_kbd_10_9_7"
keys=		"אבגדהוזחטיכלמנסעפצקרש¤¤¤¤ת "
altkeys=	"1234567890כךמ/.,'-()?!_@&# *$€ "
lang=		"hebrew"
altlabel=	"ABC"
type=3